{
  "Accounts without any logins or activity for six months are automatically deleted for privacy and storage hygiene. Sign in periodically to keep your recipes safe.": "Gli account senza accessi o attività per sei mesi vengono eliminati automaticamente per privacy e pulizia dello spazio di archiviazione. Accedi periodicamente per mantenere al sicuro le tue ricette.",
  "Add ingredient": "Aggiungi ingrediente",
  "Add ingredients, including optional minimums, maximums, mandatory grams, or portion sizes via the indivisible step.": "Aggiungi ingredienti, inclusi minimi, massimi opzionali, grammi obbligatori o porzioni tramite il campo indivisibile.",
  "Add meal": "Aggiungi pasto",
  "Already have an account?": "Hai già un account?",
  "Autocomplete ingredients and fine-tune the constraints.": "Completa gli ingredienti e perfeziona i vincoli.",
  "Balance macros, build meals, and stay on track across every device.": "Bilancia i macro, crea pasti da ogni dispositivo.",
  "Calculate": "Calcola",
  "Cancel": "Annulla",
  "Carbs (g)": "Carboidrati (g)",
  "Carbs (per 100g)": "Carboidrati (per 100g)",
  "Choose the macro goal you want to optimize for.": "Scegli l'obiettivo di macro che vuoi ottimizzare.",
  "Clear": "Cancella",
  "Close": "Chiudi",
  "Crafted just for me, but take it": "Fatto per me, ma vabbè prenditelo",
  "Create a": "Crea un",
  "Create a meal target to start planning.": "Crea un obiettivo pasto per iniziare a pianificare.",
  "Create a meal to begin": "Crea un pasto per iniziare",
  "Create your account": "Crea il tuo account",
  "Dashboard": "Dashboard",
  "Delete": "Elimina",
  "Deviation (%)": "Deviazione (%)",
  "Dismiss": "Ignora",
  "Edit": "Modifica",
  "Edit ingredient": "Modifica ingrediente",
  "Edit meal": "Modifica pasto",
  "Export and import meals or ingredients to share presets with teammates or clients.": "Esporta e importa pasti o ingredienti per condividere preset con colleghi o clienti.",
  "Export JSON": "Esporta JSON",
  "Fat (g)": "Grassi (g)",
  "Fat (per 100g)": "Grassi (per 100g)",
  "Getting Started": "Iniziare",
  "GitHub": "GitHub",
  "Import JSON": "Importa JSON",
  "Inactive account cleanup": "Pulizia account inattivi",
  "Include ingredients from the home dashboard, adjust their constraints, and press": "Includi ingredienti dalla dashboard principale, regola i loro vincoli e premi",
  "Include ingredients to start composing your meal. Newly added ingredients are included automatically.": "Includi ingredienti per iniziare a comporre il tuo pasto. Gli ingredienti appena aggiunti vengono inclusi automaticamente.",
  "Indivisible (g)": "Indivisibile (g)",
  "Info & Usage": "Info e Utilizzo",
  "Ingredient": "Ingrediente",
  "Ingredients": "Ingredienti",
  "Ingredients catalog": "Catalogo ingredienti",
  "Ingredients imported successfully": "Ingredienti importati con successo",
  "Jonamat Macro planner · MIT Licensed": "Jonamat Macro planner · Licenza MIT",
  "kcal": "kcal",
  "kcal target": "obiettivo kcal",
  "Loading ingredients...": "Caricamento ingredienti...",
  "Loading meals...": "Caricamento pasti...",
  "Log in": "Accedi",
  "Login": "Accesso",
  "Logout": "Esci",
  "Macro Planner": "Pianificatore Macro",
  "Macro Planner helps you compose meals that hit precise macronutrient targets by optimizing the ingredients you choose. Create targets, add your favorite foods, and let the solver balance everything for you.": "Macro Planner ti aiuta a comporre pasti che raggiungono obiettivi precisi di macronutrienti ottimizzando gli ingredienti che scegli. Crea obiettivi, aggiungi i tuoi cibi preferiti e lascia che il risolutore bilanci tutto per te.",
  "Maintain all your macro targets in one place. Import existing presets or create new ones.": "Mantieni tutti i tuoi obiettivi macro in un unico posto. Importa preset esistenti o creane di nuovi.",
  "Manage every ingredient available to the optimizer. Adjust macros and constraints.": "Gestisci ogni ingrediente disponibile per l'ottimizzatore. Regola macro e vincoli.",
  "Mandatory (g)": "Obbligatorio (g)",
  "Mandatory / Indivisible": "Obbligatorio / Indivisibile",
  "Mandatory grams ensure a food is always present — great for supplements or must-have ingredients.": "I grammi obbligatori assicurano che un alimento sia sempre presente — ottimo per integratori o ingredienti indispensabili.",
  "Max (g)": "Max (g)",
  "Maximum (g)": "Massimo (g)",
  "Meal name": "Nome pasto",
  "meal target": "obiettivo pasto",
  "Meal target": "Obiettivo pasto",
  "Meals": "Pasti",
  "Meals imported successfully": "Pasti importati con successo",
  "Meals library": "Libreria pasti",
  "Min (g)": "Min (g)",
  "Min / Max": "Min / Max",
  "Minimum (g)": "Minimo (g)",
  "Name": "Nome",
  "Need an account?": "Hai bisogno di un account?",
  "No ingredients yet. Add your first ingredient to start planning meals.": "Nessun ingrediente ancora. Aggiungi il tuo primo ingrediente per iniziare a pianificare i pasti.",
  "No meals yet. Create your first macro target to begin planning.": "Nessun pasto ancora. Crea il tuo primo obiettivo macro per iniziare a pianificare.",
  "Optimization Results": "Risultati Ottimizzazione",
  "or hit": "o premi",
  "Password": "Password",
  "Please create or select a meal to calculate.": "Crea o seleziona un pasto da calcolare.",
  "Please include at least one ingredient to run the optimizer.": "Includi almeno un ingrediente per eseguire l'ottimizzatore.",
  "Protein (g)": "Proteine (g)",
  "Protein (per 100g)": "Proteine (per 100g)",
  "Remove": "Rimuovi",
  "Repo available on": "Repository disponibile su",
  "Reset list": "Ripristina lista",
  "Review the optimization results, export your data, or iterate until the solution fits your needs.": "Rivedi i risultati dell'ottimizzazione, esporta i tuoi dati o itera finché la soluzione non soddisfa le tue esigenze.",
  "Save": "Salva",
  "Search all ingredients": "Cerca tutti gli ingredienti",
  "Select a meal target": "Seleziona un obiettivo pasto",
  "Select meal": "Seleziona pasto",
  "Sign up": "Registrati",
  "Target meal": "Pasto obiettivo",
  "Targets": "Obiettivi",
  "Tips": "Suggerimenti",
  "Totals": "Totali",
  "Unable to calculate meal": "Impossibile calcolare il pasto",
  "Unable to import ingredients": "Impossibile importare gli ingredienti",
  "Unable to import meals": "Impossibile importare i pasti",
  "Unable to login": "Impossibile accedere",
  "Unable to signup": "Impossibile registrarsi",
  "Use the indivisible field when an ingredient only comes in fixed increments (e.g. 5 g protein bars).": "Usa il campo indivisibile quando un ingrediente è disponibile solo in incrementi fissi (es. barrette proteiche da 5 g).",
  "Username": "Nome utente",
  "Username and password are required": "Nome utente e password sono obbligatori",
  "Weight (g)": "Peso (g)",
  "Welcome back": "Bentornato",
  "Welcome to Macro Planner": "Benvenuto in Macro Planner",
  "with your desired carbs, protein, and fat goals.": "con i tuoi obiettivi desiderati di carboidrati, proteine e grassi."
}
